{
  "title": "Tweet This Post! — Brandon Crawford",
  "paragraphs": "Chap Chop and I wrapped up our youth baseball camp on Friday. I met with the kids on Monday when the camp started and went back again on Friday. It was amazing to see the improvement in that short period of time. The best part, though, was just interacting with the kids.
  On Friday, when I arrived at the field where our youngest group was playing, there were runners on first and second. The little boy at shortstop — he was probably six years old — was sitting on the ground, playing in the dirt.


  (Credit: Twitter/@bcraw35, Instagram/jalynnecrawford)
  I walked over to him and bent down to talk.
  “Hey bud, whatcha doing?’’
  “Playing shortstop.’’
  “Well, I play shortstop, and I know that you’re supposed to stand up.’’
  He got to his feet. The very next pitch, the ball was hit right to him. The boy fielded it and tagged the runner out.
  “Way to go,’’ I said, giving him a fist-bump. “You think you could have done that sitting down?’’
  At the camp, we ask three things of the kids. The first is to have fun. The second is to learn one thing every day, no matter what it is. It could be the right way to put the ball on the tee, or that your grandpa’s favorite food is hot dogs. But learn something.
  The third thing is to perform at least one random act of kindness every day. Tell your mom you love her. Take out the trash. Hold the door open for someone. Tell your teacher you appreciate him or her. We explain that there’s a ripple effect. Their one act can trigger a chain reaction that can go on forever. One boy proudly reported to Chad that he had given his sister his shirt because she was cold. (Chad seriously is the perfect person to run a kids’ camp.)
  At the end of the camp on Friday, we invited the kids to ask me any questions they had. Here’s a sampling:
  How much work did you put into baseball when you were “around the age of 11’’? (I’m taking a wild guess that this boy was “around the age of 11.’’) “I went to all my teams’ practices then also practiced with my dad when he was home. When he wasn’t home, I’d hit off a tee into a screen in my backyard.’’
  When did you start playing baseball? “I started playing T-ball when I was five.’’
  Have you hit a home run over 500 feet? (I thought, “I’m not 6 feet-7 and go by the name of Aaron Judge.’’ But I said, “No, I’m just happy when it goes over the fence.’’
  How big are Major League Fields? “They vary in size. Ours is one of the bigger ones, 421 feet to right-center, which should be changed . . .’’
  When did you first play for the Giants? “I played for a Little League team that was the Giants when I was 8. But the San Francisco Giants, I was drafted in 2008.’’
  Who’s the “funnest’’ person in the clubhouse? “Eduardo Nunez. He has a really upbeat personality and he’s funny. His laugh always makes everyone else laugh. You can hear him from across the clubhouse. He’s good in the dugout, too. He’ll make a mistake and be yelling at himself on the field, and I say to him, ‘Hey, are you mad?’ — when it’s obvious that he is. And he’ll just start laughing. So even when he’s mad, or seems in a bad mood, you can still joke with him and he’ll laugh along.’’

  [Nunez told me that one time when he was with the Yankees he struck out and was clearly made when he returned to the dugout. Derek Jeter came over and said, “Why are you mad? You’re going to do that a lot. Get used to it. That’s you.’’ Jeter said it with a serious face but was just giving him a hard time. Another time, he was playing third or short and made a good play. He was fired up coming back into the dugout, giving high fives to everybody. And Jeter’s just sitting back, waiting for everyone to settle down. Then he comes over to Nunez and says, “It’s the big leagues. You’re supposed to make good plays.’’ Nunez loved Jeter’s needling.]
  We ended the day by asking the kids what one thing they learned that day.
  Chad’s seven-year-old son, Noah, said he learned how to play kick-ball. (They play kick-ball when all the baseball is done.)
  The kids offered up all kinds of answers. Then Chad called on the six-year-old boy I had met earlier in the day.
  “What did you learn today, buddy?’’
  “I learned,’’ boy answered, “to stand up in baseball!’’
  ************
  We changed up our BP music on Thursday. I introduced my country-music play list, which I’ve had since the beginning of the season. So far, after Saturday’s game, the playlist is 1–2. Small sample size, as they say.
  Thanks for reading. Tweet this out! Let people know we’re here. Leave questions and comments. The interaction with you is the best part of the blog."
}
